---
kind: other
id: Methods.T:Autodesk.Revit.DB.HermiteSurface
source: html/a6fb2414-d496-dfb6-9d7d-0e2b2eef52ea.htm
---
# HermiteSurface Methods

Create a non-periodic Hermite surface using a net of 3D points as input.